---
kind: type
id: T:Autodesk.Revit.DB.SectionType
source: html/ad9a6cf0-aa1a-d011-b399-658345721aab.htm
---
# Autodesk.Revit.DB.SectionType

Declares the section data type.

## Syntax (C#)
```csharp
public enum SectionType
```